In [ ]:
import numpy as np
import pandas as pd #Esta biblioteca es para las graficas

url1 = "https://raw.githubusercontent.com/HumbertoMezaRuiz/FisicaComputacional1/main/Actividad1/diarios.txt"  #Definimos este link para usar el texo desde ahi
encabezado = ['Fecha','Precipit','Evap','Tmax','Tmin'] #Definimos aqui los encabezados para tener mas orden al definir el df
#Ahora definimos nuestro df, donde como archivo pondremos el link url1 y en names, los encabezado definidos previamente
df_dist = pd.read_csv(url1, names=encabezado, encoding='cp1251', sep='\s+', skiprows=19, skipfooter=2, header=None, engine='python')

In [ ]:
print(df_dist.head(10))     #Esto es para ver las primeras 10 lineas del cuadro
print(df_dist.tail(10))     #Eso para ver las ultimas 10 lineas de datos

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7
5  06/03/1973        0  Nulo   25    9
6  07/03/1973        0  Nulo   26    7
7  08/03/1973        0  Nulo   27    8
8  09/03/1973        0  Nulo   27   10
9  10/03/1973        0  Nulo   23    6
           Fecha Precipit  Evap Tmax Tmin
6888  21/03/2016        0  Nulo   39   11
6889  22/03/2016        0  Nulo   34   12
6890  23/03/2016        0  Nulo   31   12
6891  24/03/2016        0  Nulo   30   11
6892  25/03/2016        0  Nulo   31    9
6893  26/03/2016        0  Nulo   30   11
6894  27/03/2016        0  Nulo   30   11
6895  28/03/2016        0  Nulo   28   12
6896  29/03/2016        0  Nulo   28   11
6897  30/03/2016        0  Nulo   29   12

In [ ]:
df_dist.shape   #Aqui podemos ver el numero de filas y columnas

(6898, 5)

In [ ]:
df_dist.info()    #Aqui vemos la cantidad de objetos por cada encabezado

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6898 non-null   object
 2   Evap      6898 non-null   object
 3   Tmax      6898 non-null   object
 4   Tmin      6898 non-null   object
dtypes: object(5)
memory usage: 269.6+ KB

In [ ]:
df_work0 = df_dist.copy()     #Hacemos una copia de nuestros datos para manipularlos sin miedo a perderlos
df_work0.head()              #Verificamos que la copia sea correcta

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7

In [ ]:
str_Nulo = 'Nulo'    #Aqui pondremos lo que querramos quitar, es decir, en mis datos hay datos que dicen 'nulos'
df_work1 = df_work0.replace(to_replace=str_Nulo, value='', regex=True)        #Reemplazamos todos los nulos, en este caso, quedara en blanco
df_work1.head()  #Checamos

        Fecha Precipit Evap Tmax Tmin
0  01/03/1973        0        29   12
1  02/03/1973        0        30   12
2  03/03/1973        0        29    9
3  04/03/1973        0        28    8
4  05/03/1973        0        28    7

In [ ]:
df_work1.info()       #Pedimos el numero de objetos
print(df_work1.head())#Imprimimos los datos de 5 filas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6898 non-null   object
 2   Evap      6898 non-null   object
 3   Tmax      6898 non-null   object
 4   Tmin      6898 non-null   object
dtypes: object(5)
memory usage: 269.6+ KB
        Fecha Precipit Evap Tmax Tmin
0  01/03/1973        0        29   12
1  02/03/1973        0        30   12
2  03/03/1973        0        29    9
3  04/03/1973        0        28    8
4  05/03/1973        0        28    7

In [ ]:
# Deseamos convertir los valores de las variables ambientales a núm. flotantes 
cols_list = ['Precipit', 'Evap', 'Tmax', 'Tmin']
for cols in cols_list:
  df_work1[cols] = pd.to_numeric(df_work1[cols], errors='coerce')

df_work1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   object
 1   Precipit  6774 non-null   float64
 2   Evap      823 non-null    float64
 3   Tmax      6818 non-null   float64
 4   Tmin      6812 non-null   float64
dtypes: float64(4), object(1)
memory usage: 269.6+ KB

In [ ]:
df_work1.isnull().sum() #Ahora vemos los objetos nulos que tenemos en cada columna

Fecha          0
Precipit     124
Evap        6075
Tmax          80
Tmin          86
dtype: int64

In [ ]:
print(df_work0.head())       #Checamos como teniamos antes los datos
print(df_work1.head())       #Checamos como ahora tenemos numeros reales y sin nulos

        Fecha Precipit  Evap Tmax Tmin
0  01/03/1973        0  Nulo   29   12
1  02/03/1973        0  Nulo   30   12
2  03/03/1973        0  Nulo   29    9
3  04/03/1973        0  Nulo   28    8
4  05/03/1973        0  Nulo   28    7
        Fecha  Precipit  Evap  Tmax  Tmin
0  01/03/1973       0.0   NaN  29.0  12.0
1  02/03/1973       0.0   NaN  30.0  12.0
2  03/03/1973       0.0   NaN  29.0   9.0
3  04/03/1973       0.0   NaN  28.0   8.0
4  05/03/1973       0.0   NaN  28.0   7.0

In [ ]:
df_work1.describe().round(2) #Una estadistica de todos nuestros datos

       Precipit    Evap     Tmax     Tmin
count   6774.00  823.00  6818.00  6812.00
mean       0.58    8.48    32.75    15.11
std        4.68    3.20     5.85     6.72
min        0.00    0.10     6.00    -1.00
25%        0.00    6.10    28.00    10.00
50%        0.00    8.60    34.00    14.00
75%        0.00   10.70    38.00    22.00
max      180.00   17.90    46.00    31.00

In [ ]:
print(df_work1.head())
print(df_work1.tail())

        Fecha  Precipit  Evap  Tmax  Tmin
0  01/03/1973       0.0   NaN  29.0  12.0
1  02/03/1973       0.0   NaN  30.0  12.0
2  03/03/1973       0.0   NaN  29.0   9.0
3  04/03/1973       0.0   NaN  28.0   8.0
4  05/03/1973       0.0   NaN  28.0   7.0
           Fecha  Precipit  Evap  Tmax  Tmin
6893  26/03/2016       0.0   NaN  30.0  11.0
6894  27/03/2016       0.0   NaN  30.0  11.0
6895  28/03/2016       0.0   NaN  28.0  12.0
6896  29/03/2016       0.0   NaN  28.0  11.0
6897  30/03/2016       0.0   NaN  29.0  12.0

In [ ]:
df_work1.describe()

          Precipit        Evap         Tmax        Tmin
count  6774.000000  823.000000  6818.000000  6812.00000
mean      0.583776    8.477521    32.752728    15.11377
std       4.675694    3.196214     5.852063     6.72071
min       0.000000    0.100000     6.000000    -1.00000
25%       0.000000    6.100000    28.000000    10.00000
50%       0.000000    8.600000    34.000000    14.00000
75%       0.000000   10.700000    38.000000    22.00000
max     180.000000   17.900000    46.000000    31.00000

In [ ]:
df_work2 = df_work1.copy() #hacemos otra copia para hacer otro cambio
df_work2['Fecha'].head()   #Veamos los datos de las fechas

0    01/03/1973
1    02/03/1973
2    03/03/1973
3    04/03/1973
4    05/03/1973
Name: Fecha, dtype: object

In [ ]:
df_work2['Fecha']=pd.to_datetime(df_work2['Fecha'], dayfirst=True).copy() #Le decimos a python que esa columna son fehcas y le decimos que el primer numero son los dias
print(df_work1.head()) #Vemos que todo este bien

        Fecha  Precipit  Evap  Tmax  Tmin
0  01/03/1973       0.0   NaN  29.0  12.0
1  02/03/1973       0.0   NaN  30.0  12.0
2  03/03/1973       0.0   NaN  29.0   9.0
3  04/03/1973       0.0   NaN  28.0   8.0
4  05/03/1973       0.0   NaN  28.0   7.0

In [ ]:
df_work2.dtypes #Vemos los tipos justo ahora

Fecha       datetime64[ns]
Precipit           float64
Evap               float64
Tmax               float64
Tmin               float64
dtype: object

In [ ]:
df_work2['Año'] = df_work2['Fecha'].dt.year  #Vamos a crear una columna con el año de las fechas
df_work2['Mes'] = df_work2['Fecha'].dt.month #y otras con el mes

In [ ]:
#Podemos checar para ver las nuevas columnas
print(df_work2.head())
print(df_work2.tail())

       Fecha  Precipit  Evap  Tmax  Tmin   Año  Mes
0 1973-03-01       0.0   NaN  29.0  12.0  1973    3
1 1973-03-02       0.0   NaN  30.0  12.0  1973    3
2 1973-03-03       0.0   NaN  29.0   9.0  1973    3
3 1973-03-04       0.0   NaN  28.0   8.0  1973    3
4 1973-03-05       0.0   NaN  28.0   7.0  1973    3
          Fecha  Precipit  Evap  Tmax  Tmin   Año  Mes
6893 2016-03-26       0.0   NaN  30.0  11.0  2016    3
6894 2016-03-27       0.0   NaN  30.0  11.0  2016    3
6895 2016-03-28       0.0   NaN  28.0  12.0  2016    3
6896 2016-03-29       0.0   NaN  28.0  11.0  2016    3
6897 2016-03-30       0.0   NaN  29.0  12.0  2016    3

In [ ]:
df_work2.info() #Y vemos tambien que en informacion detecra la columna fecha como datetime

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6898 entries, 0 to 6897
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Fecha     6898 non-null   datetime64[ns]
 1   Precipit  6774 non-null   float64
 2   Evap      823 non-null    float64
 3   Tmax      6818 non-null   float64
 4   Tmin      6812 non-null   float64
 5   Año       6898 non-null   int64
 6   Mes       6898 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(2)
memory usage: 377.4 KB